app/controllers/samples_controller.rb

SELECT * FROM `samples` WHERE (project_id = 1 and approved = false and user_id = '3') ORDER BY concat_ws(',', 'collected_on_year', 'collected_on_month', 'collected_on_day')
SELECT `dna_results`.* FROM `dna_results` WHERE (`dna_results`.sample_id IN (32,35,71,73,74,76,87,88,89,92,93,94))
SELECT `genders`.* FROM `genders` WHERE (`genders`.sample_id IN (32,35,71,73,74,76,87,88,89,92,93,94))
SELECT `mt_dnas`.* FROM `mt_dnas` WHERE (`mt_dnas`.sample_id IN (32,35,71,73,74,76,87,88,89,92,93,94))
---
  def index
    @sample = Sample.find(:all, :order => 'date_submitted', :include => [:genders, :dna_results, :mt_dnas], :conditions => "project_id = 1 and approved = false and user_id = '#{current_user.id}'")

SELECT * FROM `samples` WHERE (`samples`.`id` = 32)
SELECT `dna_results`.* FROM `dna_results` WHERE (`dna_results`.sample_id = 32)
SELECT `genders`.* FROM `genders` WHERE (`genders`.sample_id = 32)
SELECT `mt_dnas`.* FROM `mt_dnas` WHERE (`mt_dnas`.sample_id = 32)
---
  def show
#    @sample = Sample.find(params[:id])
    @sample = Sample.find(params[:id],:include => [:genders, :dna_results, :mt_dnas])

SELECT * FROM `samples` WHERE (project_id = 1 and approved = false and user_id = '3')
SELECT `dna_results`.* FROM `dna_results` WHERE (`dna_results`.sample_id IN (32,35,71,73,74,76,87,88,89,92,93,94,98,108,109))
SELECT `genders`.* FROM `genders` WHERE (`genders`.sample_id IN (32,35,71,73,74,76,87,88,89,92,93,94,98,108,109))
SELECT `mt_dnas`.* FROM `mt_dnas` WHERE (`mt_dnas`.sample_id IN (32,35,71,73,74,76,87,88,89,92,93,94,98,108,109))
---
  def tracker
#    puts 'tracker in controller'
    @sample = Sample.find(:all, :include => [:genders, :dna_results, :mt_dnas ], :conditions => "project_id = 1 and approved = false and user_id = '#{current_user.id}'")

SELECT * FROM `samples` WHERE (`samples`.`id` = 92)
---
  def edit
    @sample = Sample.find(params[:id])

SELECT * FROM `samples` WHERE (`samples`.`id` = 92)
UPDATE `samples` SET `import_permit` = '', `sample_bc` = '', `export_permit` = '', `current_location` = '', `collected_on_year` = '', `collected_on_day` = '', `collected_on_month` = '', `comments` = '', `text_tissue_type` = '', `organization_id` = '', `field_ident` = '' WHERE `id` = 116
---
  def update
    @sample = Sample.find(params[:id])

    respond_to do |format|
      if @sample.update_attributes(params[:sample])