app/controllers/samples_controller.rb

SELECT * FROM `organizations` WHERE (`organizations`.`id` = 179214) LIMIT 1
---
  def show
    @sample = Sample.find(params[:id],:include => [:genders, :dna_results, :mt_dnas])
    @sfw = 100
    @org = Organization.find_by_id(@sample.organization_id)